app/Models/usuario_Model.php

    public function getUsuarios(){
        return $this->findAll();
---
SELECT *
FROM `usuarios`

    public function getUsuario($id_usuario){
        return $this->where('id_usuario', $id_usuario)->first($id_usuario);
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '14'
 LIMIT 1

    public function updateDatos($id_usuario, $datos){
        return $this->update($id_usuario, $datos);
---
UPDATE `usuarios` SET `nombre` = 'Atilio', `apellido` = 'Rojas', `email` = 'atilio@gmail.com', `usuario` = 'atiiii', `pass` = '$2y$10$R6.85Io6L/THHdGhpygZIeyvwOEvywdW2pdk05WTFlroe0hwOv0Y2'
WHERE `usuarios`.`id_usuario` IN ('14')